In [9]:
import pandas as pd
import numpy as np

print(pd.__version__)

2.3.3

In [10]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0  0.512306  0.538191  1.691151  1.092381
1      1       NaN -0.249887       NaN  1.391411
2      2  1.674182 -0.199151  1.126905 -0.233394
3      3 -1.799467  0.105593 -0.541552  0.744260
4      4 -2.022821  0.854405       NaN  0.602091

In [11]:

df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0  0.512306  0.538191  1.691151  1.092381
1  1       NaN -0.249887       NaN  1.391411
2  2  1.674182 -0.199151  1.126905 -0.233394
3  3 -1.799467  0.105593 -0.541552  0.744260
4  4 -2.022821  0.854405       NaN  0.602091

In [12]:

df_backup = df.copy(deep=True)

In [13]:

df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

In [14]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

   Z         A         B         C         D
0  0  0.512306  0.538191  1.691151  1.092381
2  2  1.674182 -0.199151  1.126905 -0.233394
3  3 -1.799467  0.105593 -0.541552  0.744260
7  7  1.596474  1.695133  0.891055 -0.120736
8  8 -1.128146  1.253467  1.040037 -0.616132

In [15]:

df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.133333
B    0.166667
C    0.366667
D    0.266667
dtype: float64

In [16]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z
0  0
1  1
2  2
3  3
4  4